       IDENTIFICATION DIVISION.
       PROGRAM-ID.  hello.
       AUTHOR. Sina Sadeqi. 
       INSTALLATION. COBOL DEVELOPMENT CENTER. 
       DATE-WRITTEN. 29/03/2024. 
       SECURITY. NON-CONFIDENTIAL.
      *****************************************************************
      ******************************************************************
       PROCEDURE DIVISION.
           DISPLAY  "HELLO WORLD".
           STOP RUN.