      *****************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID.  input.
       AUTHOR. sina sadeqi. 
       INSTALLATION. COBOL DEVELOPMENT CENTER. 
       DATE-WRITTEN. 01/01/08. 
       SECURITY. NON-CONFIDENTIAL.
      *****************************************************************